#5-5 მაგალითი (>, <, ==, >=, <=, !=) 

#მაგალითები მეტობაზე
print(5 > 4)
print(14 > 13)
print(325 > 321)
print(16 > 2)
print(99 > 98)


#მაგალიტები ნაკლებობაზე
print(13 < 23)
print(24 < 25)
print(98 < 100)
print(77 < 99)
print(62 < 63)


#მაგალითები ტოლობაზე
print(588888848 == 588888848)
print(579040501 == 579040501)
print(598695444 == 598695444)
print(593409730 == 593409730)
print(593739301 == 593739301)


#მაგალითები მეტია ან ტოლიაზე
print(34 >= 14)
print(49 >= 49)
print(12 >= 10)
print(77 >= 77)
print(11 >= 10)

#მაგალითები ნაკლებია ან ტოლიაზე
print(55 <= 55)
print(12 <= 99)
print(88 <= 88)
print(34 <= 35)
print(42 <= 79)

#მაგალითები არ უდრის-ზე (!=)
print(15 != 13)
print(49 != 14)
print(10 != 99)
print(17 != 33)
print(99 != 24)



#10-10 მაგალითი And და or ოპერატორებზე


#And ოპერატორი
print(33 > 12 and 54 < 33)
print(12 > 11 and 77 < 78)
print(56 < 55 and 45 <= 45)
print(76 >= 33 and 21 < 22)
print(21 <= 21 and 83 != 15)
print(56 > 58 and 12 < 10)
print(99 != 63 and 87 != 21)
print(21 > 15 and 21 == 21)
print(76 >= 21 and 53 <= 76)
print(33 < 14 and 76 > 99)
print(654 != 654 and 642 >= 148)

#or ოპერატორი

print(13 > 15 or 67 < 68)
print(65 >= 65 or 63 != 44)
print(45 == 31 or 21 > 77)
print(66 > 17 or 14 <= 15)
print(1 > 2 or 2 >= 1)
print(99 <= 98 or 100 > 101)
print(88 < 34 or 14 >= 14)
print(45 > 12 or 99 <= 99)
print(54 >= 43 or 12 != 12)
print(12 > 43 or 72 != 55)