"""შექმენით ფუნქციოა სახელად filter_odd რომელსაც გადაეცემა ერთი არგუმენტი და ეს არის რიცხვების სია, თვქენი დავალებაა დააბრუნოთ 
ფუნქციიდან ახალი სია სადაც მხოლოდ იქნება ლუწი რიცხვები მოცემული (აგრეთვე ახსენით რა არის ფუნქცია, პარამეტრი, არგუყმენტი და რგორო 
უნდა გამოვიძახოთ ის)"""


def filter_odd(numbers):
    return [num for num in numbers if num % 2 == 0]

numbers = [1, 2, 3, 4, 5, 6]
even_numbers = filter_odd(numbers)

print(even_numbers)



#1.
#ფუნქცია არის კოდი, რომელიც ერთდროულად ასრულებს კონკრეტულ დავალებას და შეიძლება იყოს ხელახლა გამოყენებული სხვადასხვა ადგილას პროგრამაში. Python-ში ფუნქციები შეგვიძლია შევქმნათ def ქივორდით.
def greet():
    print("Hello, World!")



#2.
#პარამეტრი არის ვალიდური ცვლადები, რომლებიც ფუნქციის დეკლარაციის დროს გადაეცემა ფუნქციას და რომლის საშუალებითაც ფუნქცია მუშაობს.
def greet(sandro):
    print(f"Hello, {sandro}")
#ამ შემთხვევაში, name არის პარამეტრი, რომელიც ეხმარება ფუნქციას მიაწვდოს ინდივიდუალური Greeting.
