#ორ რიცხვს შორის შეკრება
print(5 + 5)

#ორ რიცხვს შორის გამოკლება
print(10 - 5)

#ორ რიცხვს შორის გამრავლება
print(7 * 7)

#ორ რიცხვს შორის გაყოფა
print(50 / 2)

#ორი ტექსტური მონაცემის შეერთება
name = "sandro"
surname = "maisuradze"
print(name + " " + surname)
#შევაერთე შემი სახელი და გვარი, საბოლოოდ კი მივიღე sandro maisuradze

#ძალით დაშვებული შეცდომები (ზოგგან ფრჩხილები დავაკელი ზოგგან ბრჭყალები რომ ძალით დაშვებული შეცდომა გამოსულიყო მაგრამ მერე ყველგან ერორს მიწერდა ამიტომაც ისევ სწორად ჩავწერე)
name = "guka"
surname = "kilasonia"
print(name + " " + surname)

#ტერმინალი არის გვერდი სადაც ვხვდებით ჩვენს მიერ დაწერილი კოდის შედეგს. ტერმინალში შეიძლება შეცდომის დაშვების შემდეგ ამოგვიგდოს ერორი და მიგვიყვანოს შეცდომამდე რომ უფრო მარტივად და მოკლე დროში გამოვასწოროთ
      
#ორი ცვლადის შექმნა და მასში არითმეტიკული მოქმედების დაბეჭდვა
age = "16"
height = "170.5"
print (age + " " + height)

#სტრინგის და მთელი რიცხვის ახსნა
#სტრინგი გამოხატავს სიტყვას ანუ მაგალიტად print("sandro") სანდრო არის სტრინგი.
#ხოლო რაც შეეხება მთელ რიცხვს, მთელი რიცხვს პროგრამირებაში ეწოდება ინტეჯერი ანუ მაგალითად: print(7 + 7)